In [9]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [11]:
ar1 = np.arange(4)
ar1

array([0, 1, 2, 3])

In [12]:
ar1 = np.arange(4).reshape(2,2)
ar1

array([[0, 1],
       [2, 3]])

In [13]:
ar1 = np.concatenate([ar1,ar1],axis=0)

In [19]:
df1 = DataFrame({'a':[1,2,3],
                'b':[4,5,6]})
df1

   a  b
0  1  4
1  2  5
2  3  6

In [20]:
df2 = DataFrame({'a':[10,11],
                'b':[40,50]})
df2

    a   b
0  10  40
1  11  50

In [25]:
df3 = DataFrame({
    'a':[40,50,60],
    'b':[70,80,90],
    'c':[10,11,12]
    })
df3

    a   b   c
0  40  70  10
1  50  80  11
2  60  90  12

In [26]:
pd.concat([df1, df2])

    a   b
0   1   4
1   2   5
2   3   6
0  10  40
1  11  50

In [27]:
pd.concat([df1, df2],axis=1)

   a  b     a     b
0  1  4  10.0  40.0
1  2  5  11.0  50.0
2  3  6   NaN   NaN

In [37]:
pd.concat([df1, df2],axis =1,join = 'inner')
pd.concat([df1, df2],axis =1,join = 'inner',keys = ["ONE","TWO"])

  ONE        TWO
    A  B   C   a   b
0   1  5   9  10  40
1   2  6  10  11  50

In [40]:
b = pd.concat([df1, df2],axis =0,join = 'inner',keys = ["ONE","TWO"])

In [41]:
df1 = DataFrame({
    'A':[1,2,3,4],
    'B':[5,6,7,8],
    'C':[9,10,11,12]
}) 
df1

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [52]:
df2 = DataFrame({
    'A':['a','b','c','d'],
    'D':['e','f','g','j'],
    'E':['i','j','k','l']
})
df2

   A  D  E
0  a  e  i
1  b  f  j
2  c  g  k
3  d  j  l

In [56]:
df1.combine_first(df2)

   A  B   C  D  E
0  1  5   9  e  i
1  2  6  10  f  j
2  3  7  11  g  k
3  4  8  12  j  l

In [49]:
list = [1,2,3,4]

In [3]:
a = np.array(list1)

In [4]:
a

array([1, 2, 3])

In [5]:
b = np.array([[1,2,3],[4,5,6]])

In [6]:
b.shape

(2, 3)

In [7]:
b

array([[1, 2, 3],
       [4, 5, 6]])

In [8]:
lst = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
arr = np.array(lst)
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [9]:
a= arr[1:, 1:]
print(a)

[[5 6]
 [8 9]]

In [10]:
a = arr[0:, 2:]
print(a)

[[3]
 [6]
 [9]]

In [11]:
a = arr[0:2, 0:2]
print(a)

[[1 2]
 [4 5]]

In [46]:
bool_array = np.array([
    [False, True, False],
    [True, False, True],
    [False, True, False]
])
n = arr[bool_array]
print(n)

[2 4 6 8]

In [13]:
a = np.array(lst)
bool_indexing = (a % 2 == 0)
print(bool_indexing)
print(a[bool_indexing])

[[False  True False]
 [ True False  True]
 [False  True False]]
[2 4 6 8]

In [17]:
print(a[bool_indexing])
n = a[a % 2 == 0]

[2 4 6 8]

In [20]:
a = np.arange(4)
b = np.arange(4,8)

In [21]:
c = a + b
c = np.add(a,b)
print(c)

[ 4  6  8 10]

In [25]:
c = a - b
c = np.subtract(a,b)
print(c)

[-4 -4 -4 -4]

In [27]:
c =  a * b
c = np.multiply(a,b)
print(c)

[ 0  5 12 21]

In [47]:
c = a / b
c = np.divide(a,b)
print(c)

[0.         0.2        0.33333333 0.42857143]